old/buggy/app/views/links/show.html.erb

<ul>
  <% @link.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 1]]