old/buggy/app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "teehee"], ["url", "cats.com"], ["user_id", 1], ["created_at", "2017-04-23 19:16:25.089926"], ["updated_at", "2017-04-23 19:16:25.089926"]]
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @link = Link.new(link_params)
    @link.user_id = current_user.id
    if @link.save

SELECT  "links".* FROM "links" WHERE "links"."user_id" = ? AND "links"."id" = ? LIMIT 1  [["user_id", 2], ["id", 1]]
UPDATE "links" SET "title" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", "I is jill"], ["updated_at", "2017-04-23 19:17:38.002598"], ["id", 1]]
---
  def update
    @link = current_user.links.find(params[:id])
    if @link.update_attributes(link_params)